================================================================================
Simple Function
================================================================================

<fn -> str> || { "Hiya" }

--------------------------------------------------------------------------------

(root
  (statement
    (expression
      (value
        (function
          (type_definition
            (type
              (type)))
          (block
            (statement
              (expression
                (value
                  (string))))))))))

================================================================================
Function Assignment
================================================================================

foobar = <fn -> str> |text| { text }

--------------------------------------------------------------------------------

(root
  (statement
    (assignment
      (identifier)
      (assignment_operator)
      (statement
        (expression
          (value
            (function
              (type_definition
                (type
                  (type)))
              (identifier)
              (block
                (statement
                  (expression
                    (identifier)))))))))))

================================================================================
Function Call
================================================================================

(foobar "Hiya")

--------------------------------------------------------------------------------

(root
  (statement
    (expression
      (function_call
        (identifier)
        (expression
          (value
            (string)))))))

================================================================================
Complex Function
================================================================================

<fn str num> |message number| {
  (output message)
  (output number)
}

--------------------------------------------------------------------------------

(root
  (statement
    (expression
      (value
        (function
          (type_definition
            (type
              (type)
              (type)))
          (identifier)
          (identifier)
          (block
            (statement
              (expression
                (function_call
                  (identifier)
                  (expression
                    (identifier)))))
            (statement
              (expression
                (function_call
                  (identifier)
                  (expression
                    (identifier)))))))))))

================================================================================
Complex Function Call
================================================================================

(foobar
    "hi"
    42
    {
      x = 1
      y = 2
    }
)

--------------------------------------------------------------------------------

(root
  (statement
    (expression
      (function_call
        (identifier)
        (expression
          (value
            (string)))
        (expression
          (value
            (integer)))
        (expression
          (value
            (map
              (identifier)
              (statement
                (expression
                  (value
                    (integer))))
              (identifier)
              (statement
                (expression
                  (value
                    (integer)))))))))))
