================================================================================
Simple Function
================================================================================

function { "Hiya" }

--------------------------------------------------------------------------------

(root
  (block
    (statement
      (expression
        (value
          (function
            (block
              (statement
                (expression
                  (value
                    (string)))))))))))

================================================================================
Function Call
================================================================================

(foobar "Hiya")

--------------------------------------------------------------------------------

(root
  (block
    (statement
      (expression
        (function_call
          (identifier)
          (expression
            (value
              (string))))))))

================================================================================
Complex Function
================================================================================

function <message number> {
  (output message)
  (output number)
}

--------------------------------------------------------------------------------

(root
  (block
    (statement
      (expression
        (value
          (function
            (parameter_list
              (identifier)
              (identifier))
            (block
              (statement
                (expression
                  (function_call
                    (built_in_function
                      (expression
                        (identifier))))))
              (statement
                (expression
                  (function_call
                    (built_in_function
                      (expression
                        (identifier)))))))))))))

================================================================================
Complex Function Call
================================================================================

(foobar
    "hi"
    42
    {
      x = 1
      y = 2
    }
)

--------------------------------------------------------------------------------

(root
  (block
    (statement
      (expression
        (function_call
          (identifier)
          (expression
            (value
              (string)))
          (expression
            (value
              (integer)))
          (expression
            (value
              (map
                (identifier)
                (statement
                  (expression
                    (value
                      (integer))))
                (identifier)
                (statement
                  (expression
                    (value
                      (integer))))))))))))
